Luczia/NUC401-SPI-Encoder/Core/Src/main.cpp
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"


/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32f4xx_hal.h"
#include "stdio.h"
#include "stdarg.h"
#include "string.h"
#include "as5048a.h"
#include "icHausMu.hpp"
#include "dwt_delay.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
SPI_HandleTypeDef hspi2;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
// Global flags
volatile uint8_t spi_xmit_flag = 0;
volatile uint8_t spi_recv_flag = 0;


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI2_Init(void);
static void MX_USART2_UART_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

AS5048A angleSensor(&hspi2, SPI2_AS5048_CS_GPIO_Port, SPI2_AS5048_CS_Pin);
IcHausMu ichausmu_enc(ICHAUSMU_HW_REV);

#ifdef __GNUC__
	#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
	#define PUTCHAR_PROTOTYPE int std::fputc(int ch, FILE *f)
#endif /* __GNUC__ */

/**
 * @brief Retargets the C library printf function to the USART.
 * @param None
 * @retval None
 */
#ifdef __cplusplus
 extern "C" {
#endif

		PUTCHAR_PROTOTYPE
		{
		 /* Place your implementation of fputc here */
		 /* e.g. write a character to the USART2 and Loop until the end of transmission */
		 HAL_UART_Transmit(&huart2, (uint8_t *)&ch, 1, 0xFFFF);

		return ch;
		}

#ifdef __cplusplus
}
#endif
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	uint16_t zero_position;
	float zero_position_map;

	uint8_t init_seq[6];

	uint8_t spi_tx[3] = {1,2,3};
	uint8_t spi_rx[3] = {1,2,3};
	uint8_t addr;


  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */
  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI2_Init();
  MX_USART2_UART_Init();

  /* USER CODE BEGIN 2 */
  DWT_Init();  // Init the Data Watchpoint and Trace Unit on TIM4 to enable delays in µs

  addr = 0x3FFF;
  spi_tx[0] = 0x97;
  spi_tx[1] = 0x74;

  //Init AS5048
  /*zero_position = angleSensor.getRawRotation();
  printf("Zero: %d\n", zero_position);
  zero_position_map = angleSensor.read2angle(zero_position);
  printf("Angle: %f\n", zero_position_map);*/

  //Init IcMu
  ///Init Attach NSS and transfer functions to encoder;
  ichausmu_enc.csFunctionAttach(ChangeCS);
  ichausmu_enc.streamFunctionAttach(TransferIcMU);

  //HAL_GPIO_WritePin(SPI2_ICMU_CS_GPIO_Port, SPI2_ICMU_CS_Pin, GPIO_PIN_SET);
  printf("IcMU Init\n");
  encoder_init_ichaus(init_seq);
  for(int i = 0; i < sizeof(init_seq); i++)
        printf(" %d ,", init_seq[i]);
  printf("\n");



  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

	  //***********// Read the AS5048
	  //***********//
	    /*  uint16_t current_angle= angleSensor.getRawRotation();
	  	  float current_angle_map = angleSensor.read2angle(current_angle);
	  	  float angle = current_angle_map - zero_position_map;
	  	  angle = angleSensor.normalize(angle);
	  	  printf("Current Angle: %d\nCurrent Angle Map: %f\nAngle: %f\n\n", current_angle, current_angle_map, angle);*/
	  	//if (angleSensor.error()) { printf("ERROR: %d\n", angleSensor.getErrors());  }

	  //**********// Read the iCMu
	  //**********//
	  HAL_GPIO_TogglePin(LD2_GPIO_Port, LD2_Pin);

	  uint16_t pos = 28;
	  uint8_t status = read_pos_ichaus(&pos);
	  float posDeg = pos*360/65536.0;
	  printf("Current Angle: %.3f | %d | %d \n", posDeg, pos, status);

/*	  spi_tx[0] = 0x97;
	  spi_tx[1] = 0x74;
	  HAL_GPIO_WritePin(SPI2_ICMU_CS_GPIO_Port, SPI2_ICMU_CS_Pin, GPIO_PIN_RESET);
	  HAL_SPI_TransmitReceive(&hspi2, spi_tx, spi_rx, 2, 100);
	  HAL_GPIO_WritePin(SPI2_ICMU_CS_GPIO_Port, SPI2_ICMU_CS_Pin, GPIO_PIN_SET);
	  spi_tx[0] = 0xad;
	  spi_tx[1] = 0x00;
	  spi_tx[2] = 0x00;
	  DWT_Delay(10);
	  HAL_GPIO_WritePin(SPI2_ICMU_CS_GPIO_Port, SPI2_ICMU_CS_Pin, GPIO_PIN_RESET);
	  HAL_SPI_TransmitReceive(&hspi2, spi_tx, spi_rx, 3, 100);
	  HAL_GPIO_WritePin(SPI2_ICMU_CS_GPIO_Port, SPI2_ICMU_CS_Pin, GPIO_PIN_SET);*/
	  DWT_Delay(10);
	  HAL_Delay(1000);





  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);
  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief SPI2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_SPI2_Init(void)
{

  /* USER CODE BEGIN SPI2_Init 0 */

  /* USER CODE END SPI2_Init 0 */

  /* USER CODE BEGIN SPI2_Init 1 */

  /* USER CODE END SPI2_Init 1 */
  /* SPI2 parameter configuration*/
  hspi2.Instance = SPI2;
  hspi2.Init.Mode = SPI_MODE_MASTER;
  hspi2.Init.Direction = SPI_DIRECTION_2LINES;
  hspi2.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi2.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi2.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi2.Init.NSS = SPI_NSS_SOFT;
  hspi2.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_128;
  hspi2.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi2.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi2.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi2.Init.CRCPolynomial = 10;
  if (HAL_SPI_Init(&hspi2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN SPI2_Init 2 */

  /* USER CODE END SPI2_Init 2 */

}

/**
  * @brief USART2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART2_UART_Init(void)
{

  /* USER CODE BEGIN USART2_Init 0 */

  /* USER CODE END USART2_Init 0 */

  /* USER CODE BEGIN USART2_Init 1 */

  /* USER CODE END USART2_Init 1 */
  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART2_Init 2 */

  /* USER CODE END USART2_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, SPI2_ICMU_CS_Pin|SPI2_AS5048_CS_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : B1_Pin */
  GPIO_InitStruct.Pin = B1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(B1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LD2_Pin */
  GPIO_InitStruct.Pin = LD2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LD2_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : SPI2_ICMU_CS_Pin SPI2_AS5048_CS_Pin */
  GPIO_InitStruct.Pin = SPI2_ICMU_CS_Pin|SPI2_AS5048_CS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void encoder_init_ichaus(uint8_t* init_seq){

HAL_GPIO_WritePin(SPI2_ICMU_CS_GPIO_Port, SPI2_ICMU_CS_Pin, GPIO_PIN_SET);

if (init_seq == NULL)
	    {
	      uint8_t init_seq[6] = {20,20,20,20,20,20};
	    }

init_seq[0] = (uint8_t)ichausmu_enc.init();
init_seq[1] = (uint8_t)ichausmu_enc.writeIcMuRegister(CIBM, 0x08);       // set bias current, Determined by firstTimeSetup()
init_seq[2] = (uint8_t)ichausmu_enc.writeIcMuRegister(LIN, 0x00);       // set the target type as rotative
init_seq[3] = (uint8_t)ichausmu_enc.writeIcMuRegister(MPC, 0x05);       // magnetic target is a 32master/31Nonius period
init_seq[4] = (uint8_t)ichausmu_enc.changeSdadMode(0x00, 18, 3);        // define the SDAD output
init_seq[5] = (uint8_t)ichausmu_enc.setAutomaticGain(true);
}


uint8_t read_pos_ichaus(uint16_t* pos){
  uint8_t status;
  uint16_u posICMU;
  status = (uint8_t)ichausmu_enc.readPos(&posICMU);

  *pos = (uint16_t)posICMU.word;

  return status;
}

// Function to select the slave (in this case ic-MU)
void ChangeCS(bool state)
{

  if(state)
	  HAL_GPIO_WritePin(SPI2_ICMU_CS_GPIO_Port, SPI2_ICMU_CS_Pin, GPIO_PIN_RESET);
  else
	  HAL_GPIO_WritePin(SPI2_ICMU_CS_GPIO_Port, SPI2_ICMU_CS_Pin, GPIO_PIN_SET);
 }

// Function to echange data the slave (in this case ic-MU)
void TransferIcMU(unsigned char* const txBuffer, unsigned char* rxBuffer, const unsigned int bufferLen)
{
  //spiExchange(&SPID1, bufferLen, txBuffer, rxBuffer);
  HAL_SPI_TransmitReceive(&hspi2, txBuffer, rxBuffer, bufferLen, 1);

}



/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
